from llama_cpp import Llama

llm = Llama(
      model_path="dorna-llama3-8b-instruct.Q4_1.gguf",
      chat_format="llama-3",
      n_gpu_layers=-1,
      n_ctx=2048,
      verbose=False
)

# messages = [
#     {"role": "system", "content": "توی یک دستیار هوشمند هستی، لطفا به سوالات کاربر به همان زبان پاسخ دقیق و مختصر بده"},
#     {"role": "user", "content": """
#       مجتمع می‌باشد .
# کف اتاق خواب پارکت می‌باشد.
# در ورودی خانه ضد سرقت می‌باشد .
# دید کامل ب داخل مجتمع از پنجره .
# نور گیر عالی .
# ساختمان بی صدا.
# همسایه ها ب هم دگ کار ندارند.
# انباری بزرگ.
# جای پارک ماشین زیر پنجره یا داخل مجتمع امکان پذیر می‌باشد .
# امنیت بالا.
# برای دریافت عکس یا فیلم لطفا پیام دهید با تشکر.
#  پردیس(شهر) این متن رو برام تعغیر بده
#     """},
# ]
# result = llm.create_chat_completion(
#     messages = messages,
#     top_p=0.85,
#     temperature=0.1

# )

# print(result['choices'][0]['message']['content'])

# inti_prompt = '''
# Rewrite the following Persian text with a formal tone, 

# Output Goal:
# Keep the text friendly and persian, concise, and accurate.
# Avoid adding any extra details (e.g., location) unless explicitly provided.
# Ensure clarity without over-elaboration.

# '''


inti_prompt = '''
You are an intelligent assistant that can change the entered text you can change the tune to friendlier format or more formal.ensuring it is concise and clear while retaining the essential details.

For any other questions, you should provide a textual response.

**Examples:**
- Input: "با سلام
    زمین ۳۰۰ متری دهنه ۱۰ متر کوچه باغ بعد از تالار همایون کوچه املاک نوروزی زمین خالی دوم سمت راست دور زمین شفته شده و کاملا مشخص هست قابل ساخت آب سر زمین هست
    سند مادر زمین هست و قولنامه معتبر زمین
    فروش فوری معاوضه با ماشین هم قیمت خودش دارم"
  Output: "فروش زمین 300 متری
    دهنه 10 متر، کوچه باغ بعد از تالار همایون، کوچه املاک نوروزی، زمین خالی دوم سمت راست. دور زمین شفته‌کشی شده و کاملاً مشخص است، قابل ساخت. آب در سر زمین موجود است. سند مادر زمین و قولنامه معتبر دارد.
    فرصت فروش فوری و معاوضه با خودرو هم قیمت."

- Input: "ک واحد آپارتمان همکف شیک یک خواب متراژ 63 متر واقع در بلوار توس میدان معراج توس 43 حاشیه خدابنده 10
    حاشیه خیابان 10متری
    ✅ فاصله نزدیک به ایستگاه بی آرتی ، مرکز خرید نانوایی ، تره بار ، بانک و درمانگاه ، داروخانه ، بیمارستان امکانات رفاهی کامل
    ✅ ٪۱۰۰ منزل بازسازی شده با بهترین مصالح
    ✅ درب ضدسرقت
    دربهای حمام و توالت مستر
    ✅ وصل به اگو
    ✅ ساختمان دو طبقه کلا ۳ واحد آرام و بی حاشیه که بزرگترین امتیاز هست
    ✅ کابینت ام دی آف
    ✅ هود لمسی ، گاز رومیزی 5 شعله
    ✅ سقف نور مخفی
    ✅ سرامیک کف ۸۰×۸۰ نانو پولش کلیه سرامیک مصرف شده سرویس بهداشتی و حمام و کف کاشی درجه یک استفاده شده
    ✅ شیرآلات اهرمی
    ✅ سنگ توالت خارجی
    ✅ کلیه لوله‌های آب کف و بدنه عوض شده
    شخصی سازی و سفارشی برای خودم شیک و امروزی ساختم ، مناسب تازه عروس و داماد
    ✅ مدارک آپارتمان قولنامه ای است معتبر پشت در پشت
    ✅ معاوضه با خودرو هم دارم"
  Output: `
    آپارتمان همکف شیک 63 متری
    یک خواب، واقع در بلوار توس، میدان معراج توس 43، حاشیه خدابنده 10.
    ویژگی‌های برجسته:

    فاصله نزدیک به ایستگاه بی‌آرتی، مراکز خرید، نانوایی، تره‌بار، بانک، درمانگاه، داروخانه، بیمارستان
    100% بازسازی شده با بهترین مصالح
    درب ضد سرقت
    درب‌های حمام و توالت مستر
    اتصال به آگو
    ساختمان دو طبقه با 3 واحد، محیط آرام و بی‌حاشیه
    کابینت MDF با هود لمسی و گاز رومیزی 5 شعله
    سقف نور مخفی
    سرامیک کف 80×80 نانو پولیش شده
    شیرآلات اهرمی، سنگ توالت خارجی
    تعویض کامل لوله‌های آب کف و بدنه
    طراحی شیک و سفارشی، مناسب برای تازه‌عروس‌ها
    مدارک قولنامه‌ای معتبر
    امکان معاوضه با خودرو
  `

- Input: "آپارتمان ۶۵متری
    تک خواب
    یک سال ساخت
    کابینت ام دی اف
    درب ضد سرقت
    آیفون تصویری
    مورد مناسب برای خانه اولی ها و سرمایه گذاری
    تخفیف پای معامله"
  Output: `
    آپارتمان 65 متری
    یک خواب، یک سال ساخت
    کابینت MDF
    درب ضد سرقت
    آیفون تصویری
    مناسب برای خانه اولی‌ها و سرمایه‌گذاری
    تخفیف پای معامله
'''

messages = [
    {"role": "system", "content": inti_prompt},
    {"role": "user", "content": 
    '''
اواسط امامت
بازسازی شده
تخلیه
دو خواب
ام دی اف
لطفاً متن ورودی را با این رویکرد و سبک بازنویسی کنید.
    '''},
] 



result = llm.create_chat_completion(
    messages = messages,
    top_p=0.85,
    temperature=0.5
)

response = result['choices'][0]['message']['content']
print(response)